import { Holiday } from '../enums/holiday.enum';
import { HolidayExpenseTemplate } from '../types/holiday-expense-template.types';


export const HOLIDAY_EXPENSE_TEMPLATES: ReadonlyArray<HolidayExpenseTemplate> = [
  {
    holiday: Holiday.PASSOVER,
    displayName: 'פסח',
    itemGroups: [
      {
        groupName: 'ערב פסח',
        items: [
          'קימחא דפיסחא',
          'נקיון וחומרי ניקוי',
          'צביעה/ריהוט חדש',
          'מכירת חמץ',
          'הגעלת כלים',
          'כלים חדשים',
          'נסיעות לקניות',
          'ניקוי יבש',
          'מתנות לאישה',
          'משחקים לילדים',
          'מזון ערב פסח',
          'מצות',
        ],
      },
      {
        groupName: 'מזון',
        items: [
          'יין',
          'בשר/עופות',
          'חד פעמי',
          'מכירות',
          'קניה בסופר',
          'מוצרי איפור',
        ],
      },
      {
        groupName: 'ביגוד והנעלה',
        items: [
          'ביגוד בעל',
          'ביגוד אישה',
          'ביגוד בנים',
          'ביגוד בנות',
          'ביגוד קיץ',
        ],
      },
      {
        groupName: 'עליה לרגל',
        items: [
          'קרבן פסח',
          'קרבן חגיגה',
          'עולת ראייה',
          'שלמי שמחה',
          'נסיעות לירושלים',
          'נסיעות להורים',
        ],
      },
      {
        groupName: 'חול המועד',
        items: [
          'טיולים',
          'אפיקומן',
          'מתנות',
          'אירוח ידידים/משפחה',
          'אירועים/תוכניות',
          'מזון לאחר הפסח',
        ],
      },
    ],
  },
  {
    holiday: Holiday.ROSH_HASHANA,
    displayName: 'ראש השנה',
    itemGroups: [
      
  {
    groupName: 'סעודות החג ואירוח',
    items: [
      'בשר/עופות',
      'חד פעמי',
      'מכירות',
      'קניה בסופר',
      'סימנים',
      'מוצרי איפור',
      'דירות להשכרה /חדרי אירוח',
    ],
  },
  {
    groupName: 'ביגוד והנעלה',
    items: [
      'ביגוד בעל',
      'ביגוד אישה',
      'ביגוד בנים',
      'ביגוד בנות',
      'קיטל',
    ],
  },
  {
    groupName: 'הוצאות קודש',
    items: [
      'מקומות ישיבה',
      'צדקה, תרומות ונדרים',
      'מחזורים, שופר',
    ],
  },
  {
    groupName: 'מתנות',
    items: [
      'מתנות חג להורים',
      'מתנות חג לצוות ההוראה',
      'מכתבי שנה טובה ופיתוח תמונות',
    ],
  },
  {
    groupName: 'תחבורה',
    items: [
      'השכרת רכב/ דלק/ מוניות',
      'רב קו',
    ],
  },
]

  },
  {
    holiday: Holiday.YOM_KIPPUR,
    displayName: 'יום כיפור',
    itemGroups: [
  {
    groupName: 'הכנה לצום',
    items: [
      'סעודה לפני ואחרי הצום',
      'תרופות לצום',
      'דירות אירוח',
    ],
  },
  {
    groupName: 'הוצאות קודש',
    items: [
      'פדיון כפרות',
      'תרומות ונדרים',
      'נרות',
      'מקום בבי"כ',
    ],
  },
  {
    groupName: 'ביגוד והנעלה ייעודית',
    items: [
      'נעלי בד/ גומי',
      'בגדי לבן',
    ],
  },

    ],
  },
  {
    holiday: Holiday.SUKKOT,
    displayName: 'סוכות',
    itemGroups: [
      {
        groupName: 'ערב סוכות',
        items: [
          'סכך',
          'ארבעת המינים',
          'אביזרים וקישוטים לסוכה',
          'ריהוט לסוכה',
        ],
      },
      {
        groupName: 'חג סוכות',
        items: [
          'אירוח ומצרכי בישול',
          'מתנה לאישה',
          'נסיעות',
          'אירועים מיוחדים',
        ],
      },
    ],
  },
  {
    holiday: Holiday.SIMCHAT_TORAH,
    displayName: 'שמחת תורה',
    itemGroups: [
      {
        groupName: '',
        items: [
          'הוצאות סעודת חג קהילתית',
          'הוצאות סעודת חג משפחתית',
          'נסיעות',
          'דירות אירוח',
          'מתנות לילדים',
          'רכישות ״חתנים״',
          'פאקעלאך',
        ],
      },
    ],
  },
  {
    holiday: Holiday.HANUKKAH,
    displayName: 'חנוכה',
    itemGroups: [
      {
        groupName: '',
        items: [
          'הוצאות נרות חנוכיה',
          'סופגניות ולביבות',
          'מתנות לילדים',
          'משחקי סביבון',
          'מפגשים משפחתיים',
        ],
      },
    ],
  },
  {
    holiday: Holiday.PURIM,
    displayName: 'פורים',
    itemGroups: [
      {
        groupName: 'מסיבת פורים',
        items: [
          'תחפושות',
          'משלוח מנות לחברים בכיתה',
          'מתנות לצוות החינוכי',
          'אירועים ומסיבה',
        ],
      },
      {
        groupName: 'יום פורים',
        items: [
          'משלוח מנות',
          'מתנות לאביונים',
          'מגילה ',
          'משתה פורים',
          'נסיעות',
          'הוצאות שושן פורים',
          'דמי פורים לכל הפושט יד',
        ],
      },
    ],
  },
   {
    holiday: Holiday.LAG_BAOMER,
    displayName: 'ל"ג בעומר',
    itemGroups: [
      {
        groupName: '',
        items: [
          'הוצאות מדורות',
          'נסיעות',
          'דירות אירוח',
          'הוצאות ״חלאקה״',
          'מפגש משפחתי',
        ],
      },
    ],
  },
  {
    holiday: Holiday.SHAVUOT,
    displayName: 'שבועות',
    itemGroups: [
      {
        groupName: '',
        items: [
          'מוצרי חלב מיוחדים',
          'עוגות וקינוחים',
          'קישוטים ירוקים',
          'אירוח ומצרכי בישול',
          'נסיעות',
          'דירות אירוח',
          'מתנות למבצעים לילדים',
        ],
      },
    ],
  },
  {
    holiday: Holiday.SUMMER_VACATION,
    displayName: 'חופש גדול',
    itemGroups: [
      {
        groupName: 'יציאות וטיולים',
        items: [
          'קעמפים ומחנות ממוסדות הלימוד',
          'הוצאות ביגוד וציוד לקעמפים ומחנות',
          'קייטנות ממוסדות הלימוד',
          'נסיעות',
          'דירות אירוח',
          'הוצאות על פעילויות חוץ', 
          'אתרים שונים',
          'ארוחות ומזון',
        ],
      },
      {
        groupName: 'הכנות לתחילת שנה״ל',
        items: [
          'רכישת ספרי לימוד',
          'רכישת ציוד לבית הספר',
          'רכישת ביגוד והנעלה',
          'הוצאות על חוגים',
          'הוצאות רישום למוסדות לימוד',
        ],
      },
    ],
  },
];
